package com.mycompany.stealthchatnew;

/*Данный класс возвращает алфавит, для шифрования и дешифрования сообщений - Этот класс уже есть*/
public class Alphabet {
    /*Метод возвращает массив символов, используемый для проверки алфавита*/
    public char[] getAlphabet() {
        /*Заполняем массив символами от 'а' до '~' тут 257 символа*/

        char arrayOfCharacters[] = {
                /*Алфавит*/
                'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о',
                'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю',
                'я', '.', ',', ' ', '?', 'А', 'Б', 'В', 'Г', 'Д', 'Е', 'Ё', 'Ж', 'З', 'И', 'Й',
                'К', 'Л', 'М', 'Н', 'О', 'П', 'Р', 'С', 'Т', 'У', 'Ф', 'Х', 'Ц', 'Ч', 'Ш', 'Щ',
                'Э', 'Ю', 'Я', '!', ':', '(', ')', '\n', '1', '2', '3', '4', '5', '6', '7', '8',
                '9', '0', '/', '*', '-', '+', '=', 'A', 'B', 'C', 'D', 'E', 'F', 'G', 'H', 'I',
                'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U', 'V', 'W', 'X', 'Y',
                'Z', 'a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j', 'k', 'l', 'm', 'n', 'o',
                'p', 'q', 'r', 's', 't', 'u', 'v', 'w', 'x', 'y', 'z', '%', '@', '№', '#', '$',
                ';', '^', '&', '—', '~', '☺', '☻', '♥', '♦', '♣', '♠', '•', '◘', '○', '◙', '♂',
                '♀', '♪', '♫', '☼', '►', '◄', '↕', '¶', '§', '↨', '↑', '↓', '→', '←', '∟', '↔',
                '▲', '▼', 'Ç', 'ü', '▬', 'é', 'â', 'ä', 'à', 'å', 'ç', 'ê', 'ë', 'è', 'ï', 'î',
                'ì', 'Ä', 'Å', 'É', 'æ', 'Æ', 'ô', 'ö', 'ò', 'û', 'ù', 'ÿ', 'Ö', 'Ü', '¢', '£',
                '¥', 'ƒ', 'á', 'í', 'ó', 'ú', 'ñ', 'Ñ', 'ª', 'º', '¿', '⌐', '¬', '½', '¼', '¡',
                '«', '»', '░', '▒', '▓', '│', '┤', '╡', '╢', '╖', '╕', '╣', '║', '╗', '╝', '╜',
                '╛', '┐', '└', '┴', '┬', '├', '─', '┼', '╞', '╟', '╚', '╔', '╩', '╦', '╠', '═',
                '╬'
        };

        return arrayOfCharacters;
        /*Возвращает массив символов*/
    }

    /*Метод для создания имен изображений*/
    public char[] getAlphabetImageName(){

        char arrayOfCharacters[] = {
                /*Алфавит*/
                'а', 'б', 'в', 'г', 'д', 'е', 'ё', 'ж', 'з', 'и', 'й', 'к', 'л', 'м', 'н', 'о',
                'п', 'р', 'с', 'т', 'у', 'ф', 'х', 'ц', 'ч', 'ш', 'щ', 'ъ', 'ы', 'ь', 'э', 'ю',
                'я', '1', '2', '3', '4', '5', '6', '7', '8', '9', '0', 'A', 'B', 'C', 'D', 'E',
                'F', 'G', 'H', 'I', 'J', 'K', 'L', 'M', 'N', 'O', 'P', 'Q', 'R', 'S', 'T', 'U',
                'V', 'W', 'X', 'Y', 'Z', 'é', 'â', 'ä', 'à', 'å', 'ç', 'ê', 'ë', 'è', 'ï', 'î',
                'ì', 'Ä', 'Å', 'É', 'æ', 'Æ', 'ô', 'ö', 'ò', 'û', 'ù', 'ÿ', 'Ö', 'Ü', '¢', '£',
                '¥', 'ƒ', 'á', 'í', 'ó', 'ú', 'ñ', 'Ñ'
        };

        return arrayOfCharacters;
        /*Возвращает массив символов*/
    }
}




